YanMinge/mm32_irmp_irsnd/src/components/Irsnd/irsnd.c
#elif defined (__AVR_ATmega48__)    \
   || defined (__AVR_ATmega88__)    \
   || defined (__AVR_ATmega88P__)   \
   || defined (__AVR_ATmega168__)   \
   || defined (__AVR_ATmega168P__)  \
   || defined (__AVR_ATmega328P__)                                  // ATmega48|88|168|168|328 uses OC2A = PB3 or OC2B = PD3 or OC0A = PD6 or OC0B = PD5
#  if IRSND_OCx == IRSND_OC2A                                       // OC2A
#    define IRSND_PORT_LETTER                       B
#    define IRSND_BIT_NUMBER                        3
#  elif IRSND_OCx == IRSND_OC2B                                     // OC2B
#    define IRSND_PORT_LETTER                       D
#    define IRSND_BIT_NUMBER                        3
#  elif IRSND_OCx == IRSND_OC0A                                     // OC0A
#    define IRSND_PORT_LETTER                       D
#    define IRSND_BIT_NUMBER                        6
#  elif IRSND_OCx == IRSND_OC0B                                     // OC0B
#    define IRSND_PORT_LETTER                       D
#    define IRSND_BIT_NUMBER                        5
#  else
#    error Wrong value for IRSND_OCx, choose IRSND_OC2A, IRSND_OC2B, IRSND_OC0A, or IRSND_OC0B in irsndconfig.h
#  endif // IRSND_OCx

#elif defined (__AVR_ATmega8515__)                                  // ATmega8515 uses OC0 = PB0 or OC1A = PD5 or OC1B = PE2
#  if IRSND_OCx == IRSND_OC0
#    define IRSND_PORT_LETTER                       B
#    define IRSND_BIT_NUMBER                        0
#  elif IRSND_OCx == IRSND_OC1A
#    define IRSND_PORT_LETTER                       D
#    define IRSND_BIT_NUMBER                        5
#  elif IRSND_OCx == IRSND_OC1B
#    define IRSND_PORT_LETTER                       E
#    define IRSND_BIT_NUMBER                        2
#  endif // IRSND_OCx

#elif defined (__AVR_XMEGA__)                                       // ATxmega
#  if IRSND_OCx == IRSND_XMEGA_OC0A
#    define IRSND_BIT_NUMBER                        0
#  elif IRSND_OCx == IRSND_XMEGA_OC0B
#    define IRSND_BIT_NUMBER                        1
#  elif IRSND_OCx == IRSND_XMEGA_OC0C
#    define IRSND_BIT_NUMBER                        2
#  elif IRSND_OCx == IRSND_XMEGA_OC0D
#    define IRSND_BIT_NUMBER                        3
#  elif IRSND_OCx == IRSND_XMEGA_OC1A
#    define IRSND_BIT_NUMBER                        4
#  elif IRSND_OCx == IRSND_XMEGA_OC1B
#    define IRSND_BIT_NUMBER                        5
#  else
#    error Wrong value for IRSND_OCx, choose IRSND_XMEGA_OC0A, IRSND_XMEGA_OC0B, IRSND_XMEGA_OC0C, IRSND_XMEGA_OC0D, IRSND_XMEGA_OC1A, or IRSND_XMEGA_OC1B in irsndconfig.h
#  endif // IRSND_OCx

#elif defined (PIC_C18)                                                 // Microchip C18 compiler
    //Nothing here to do here -> See irsndconfig.h
#elif defined (ARM_STM32)                                               // STM32
    //Nothing here to do here -> See irsndconfig.h
#elif defined (ARM_STM32_HAL)                                           // STM32 with Hal Library
    //Nothing here to do here -> See irsndconfig.h
#elif defined (__xtensa__)                                              // ESP8266
    //Nothing here to do here -> See irsndconfig.h
#elif defined (ARM_MM32F013X)                                           // MM32 with Hal Library
    //Nothing here to do here -> See irsndconfig.h
/*---------------------------------------------------------------------------------------------------------------------------------------------------
 * Macro digitalPinHasPWM bothers PIC_C18 compiler, but why?
 *
 * #elif defined (TEENSY_ARM_CORTEX_M4)                                // Teensy3
 * #  if !digitalPinHasPWM(IRSND_PIN)
 * #    error need pin with PWM output.
 * #  endif
 *---------------------------------------------------------------------------------------------------------------------------------------------------
 */

 #elif defined(ARDUINO)
// specified here to avoid else case

#else
#  if !defined (unix) && !defined (WIN32)
#    error mikrocontroller not defined, please fill in definitions here.
#  endif // unix, WIN32
#endif // __AVR...

#if defined(__AVR_XMEGA__)
#  define _CONCAT(a,b)                              a##b
#  define CONCAT(a,b)                               _CONCAT(a,b)
#  define IRSND_PORT                                IRSND_PORT_PRE.OUT
#  define IRSND_DDR                                 IRSND_PORT_PRE.DIR
#  define IRSND_PIN                                 IRSND_PORT_PRE.IN
#  define IRSND_BIT                                 IRSND_BIT_NUMBER
#elif defined(ATMEL_AVR)
#  define _CONCAT(a,b)                              a##b
#  define CONCAT(a,b)                               _CONCAT(a,b)
#  define IRSND_PORT                                CONCAT(PORT, IRSND_PORT_LETTER)
#  define IRSND_DDR                                 CONCAT(DDR, IRSND_PORT_LETTER)
#  define IRSND_BIT                                 IRSND_BIT_NUMBER
#endif

#if IRSND_SUPPORT_NIKON_PROTOCOL == 1
    typedef uint16_t    IRSND_PAUSE_LEN;
#else
    typedef uint8_t     IRSND_PAUSE_LEN;
#endif

/*---------------------------------------------------------------------------------------------------------------------------------------------------
 *  IR timings
 *---------------------------------------------------------------------------------------------------------------------------------------------------
 */
#define IRSND_SIRCS_START_BIT_PULSE_LEN             (uint8_t)(F_INTERRUPTS * SIRCS_START_BIT_PULSE_TIME + 0.5)
#define IRSND_SIRCS_START_BIT_PAUSE_LEN             (uint8_t)(F_INTERRUPTS * SIRCS_START_BIT_PAUSE_TIME + 0.5)
#define IRSND_SIRCS_1_PULSE_LEN                     (uint8_t)(F_INTERRUPTS * SIRCS_1_PULSE_TIME + 0.5)
#define IRSND_SIRCS_0_PULSE_LEN                     (uint8_t)(F_INTERRUPTS * SIRCS_0_PULSE_TIME + 0.5)
#define IRSND_SIRCS_PAUSE_LEN                       (uint8_t)(F_INTERRUPTS * SIRCS_PAUSE_TIME + 0.5)
#define IRSND_SIRCS_AUTO_REPETITION_PAUSE_LEN       (uint16_t)(F_INTERRUPTS * SIRCS_AUTO_REPETITION_PAUSE_TIME + 0.5)               // use uint16_t!
#define IRSND_SIRCS_FRAME_REPEAT_PAUSE_LEN          (uint16_t)(F_INTERRUPTS * SIRCS_FRAME_REPEAT_PAUSE_TIME + 0.5)                  // use uint16_t!

