YanMinge/mm32_irmp_irsnd/src/components/Irsnd/irsnd.c
// Used for Arduino by IRTimer.cpp.h
volatile uint8_t                                irsnd_busy = 0;
volatile uint8_t                                irsnd_is_on = FALSE;

static volatile uint8_t                         irsnd_protocol = 0;
static volatile uint8_t                         irsnd_buffer[11] = {0};
static volatile uint8_t                         irsnd_repeat = 0;

#if defined(ARDUINO)
#include "irsndArduinoExt.cpp.h" // must be after the declarations of irsnd_busy etc.
#else

#if IRSND_USE_CALLBACK == 1
static void                                     (*irsnd_callback_ptr) (uint8_t);
#endif // IRSND_USE_CALLBACK == 1

/*---------------------------------------------------------------------------------------------------------------------------------------------------
 *  Switch PWM on
 *---------------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
irsnd_on (void)
{
    if (! irsnd_is_on)
    {
#ifndef ANALYZE
#  if defined(PIC_C18)                                  // PIC C18
        PWMon();
        // IRSND_PIN = 0; // output mode -> enable PWM outout pin (0=PWM on, 1=PWM off)

#  elif defined (ARM_STM32)                             // STM32
        TIM_SelectOCxM(IRSND_TIMER, IRSND_TIMER_CHANNEL, TIM_OCMode_PWM1); // enable PWM as OC-mode
        TIM_CCxCmd(IRSND_TIMER, IRSND_TIMER_CHANNEL, TIM_CCx_Enable);      // enable OC-output (is being disabled in TIM_SelectOCxM())
        TIM_Cmd(IRSND_TIMER, ENABLE);                   // enable counter

#  elif defined (ARM_STM32_HAL)                         // STM32 with Hal Library
        HAL_TIM_PWM_Start(&IRSND_TIMER_HANDLER, IRSND_TIMER_CHANNEL_NUMBER);

#  elif defined (TEENSY_ARM_CORTEX_M4)                  // TEENSY
        analogWrite(IRSND_PIN, 33 * 255 / 100);         // pwm 33%

#  elif defined (__xtensa__)                            // ESP8266 (Arduino)
        analogWrite(IRSND_PIN, 33 * 1023 / 100);        // pwm 33%

#  elif defined (ARM_MM32F013X)                                         // MM32
        drv_gpio_analog_write(IRSND_PIN, 33 * 1023 / 100);              // pwm 33%

#  elif defined (__AVR_XMEGA__)
#    if (IRSND_OCx == IRSND_XMEGA_OC0A)                                 // use OC0A
                XMEGA_Timer.CTRLB |= (1<<TC0_CCAEN_bp);                 // Compare A
#    elif (IRSND_OCx == IRSND_XMEGA_OC0B)                               // use OC0B
                XMEGA_Timer.CTRLB |= (1<<TC0_CCBEN_bp);                 // Compare B
#    elif IRSND_OCx == IRSND_XMEGA_OC0C                                 // use OC0C
                XMEGA_Timer.CTRLB |= (1<<TC0_CCCEN_bp);                 // Compare C
#    elif IRSND_OCx == IRSND_XMEGA_OC0D                                 // use OC0D
                XMEGA_Timer.CTRLB |= (1<<TC0_CCDEN_bp);                 // Compare D
#    elif IRSND_OCx == IRSND_XMEGA_OC1A                                 // use OC1A
                XMEGA_Timer.CTRLB |= (1<<TC1_CCAEN_bp);                 // Compare A
#    elif IRSND_OCx == IRSND_XMEGA_OC1B                                 // use OC1B
                XMEGA_Timer.CTRLB |= (1<<TC1_CCBEN_bp);                 // Compare B
#    else
#       error wrong value of IRSND_OCx
#    endif // IRSND_OCx

#  else                                                 // AVR
#    if   IRSND_OCx == IRSND_OC2                        // use OC2
        TCCR2 |= (1<<COM20)|(1<<WGM21);                 // toggle OC2 on compare match,  clear Timer 2 at compare match OCR2
#    elif IRSND_OCx == IRSND_OC2A                       // use OC2A
        TCCR2A |= (1<<COM2A0)|(1<<WGM21);               // toggle OC2A on compare match, clear Timer 2 at compare match OCR2A
#    elif IRSND_OCx == IRSND_OC2B                       // use OC2B
        TCCR2A |= (1<<COM2B0)|(1<<WGM21);               // toggle OC2B on compare match, clear Timer 2 at compare match OCR2A (yes: A, not B!)
#    elif IRSND_OCx == IRSND_OC0                        // use OC0
        TCCR0 |= (1<<COM00)|(1<<WGM01);                 // toggle OC0 on compare match,  clear Timer 0 at compare match OCR0
#    elif IRSND_OCx == IRSND_OC0A                       // use OC0A
        TCCR0A |= (1<<COM0A0)|(1<<WGM01);               // toggle OC0A on compare match, clear Timer 0 at compare match OCR0A
#    elif IRSND_OCx == IRSND_OC0B                       // use OC0B
        TCCR0A |= (1<<COM0B0)|(1<<WGM01);               // toggle OC0B on compare match, clear Timer 0 at compare match OCR0A (yes: A, not B!)
#    else
#      error wrong value of IRSND_OCx
#    endif // IRSND_OCx
#  endif // C18
#endif // ANALYZE

#if IRSND_USE_CALLBACK == 1
        if (irsnd_callback_ptr)
        {
            (*irsnd_callback_ptr) (TRUE);
        }
#endif // IRSND_USE_CALLBACK == 1

        irsnd_is_on = TRUE;
    }
}

/*---------------------------------------------------------------------------------------------------------------------------------------------------
 *  Switch PWM off
 *  @details  Switches PWM off
 *  Only called by irsnd_ISR
 *---------------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
irsnd_off (void)
{
    if (irsnd_is_on)
    {
#ifndef ANALYZE

#  if defined(PIC_C18)                                                                  // PIC C18
        PWMoff();
        // IRSND_PIN = 1; //input mode -> disbale PWM output pin (0=PWM on, 1=PWM off)

#  elif defined (ARM_STM32)                                                             // STM32
        TIM_Cmd(IRSND_TIMER, DISABLE);                                                  // disable counter
        TIM_SelectOCxM(IRSND_TIMER, IRSND_TIMER_CHANNEL, TIM_ForcedAction_InActive);    // force output inactive
        TIM_CCxCmd(IRSND_TIMER, IRSND_TIMER_CHANNEL, TIM_CCx_Enable);                   // enable OC-output (is being disabled in TIM_SelectOCxM())
        TIM_SetCounter(IRSND_TIMER, 0);                                                 // reset counter value

#  elif defined (ARM_STM32_HAL)                                                         // STM32
        HAL_TIM_PWM_Stop(&IRSND_TIMER_HANDLER, IRSND_TIMER_CHANNEL_NUMBER);

#  elif defined (TEENSY_ARM_CORTEX_M4)                                                  // TEENSY
        analogWrite(IRSND_PIN, 0);                                                      // pwm off, LOW level

