YanMinge/mm32_irmp_irsnd/src/components/Irsnd/irsnd.c
#  elif defined (__xtensa__)                                                            // ESP8266
        analogWrite(IRSND_PIN, 0);                                                      // pwm off, LOW level

#  elif defined (ARM_MM32F013X)                                                         // MM32
        drv_gpio_analog_write(IRSND_PIN, 0);                                            // pwm off, LOW level

#  elif defined (__AVR_XMEGA__)
#    if (IRSND_OCx == IRSND_XMEGA_OC0A)                                                 // use OC0A
        XMEGA_Timer.CTRLB &= ~(1<<TC0_CCAEN_bp);                                        // Compare A disconnected
#    elif (IRSND_OCx == IRSND_XMEGA_OC0B)                                               // use OC0B
        XMEGA_Timer.CTRLB &= ~(1<<TC0_CCBEN_bp);                                        // Compare B disconnected
#    elif IRSND_OCx == IRSND_XMEGA_OC0C                                                 // use OC0C
        XMEGA_Timer.CTRLB &= ~(1<<TC0_CCCEN_bp);                                        // Compare C disconnected
#    elif IRSND_OCx == IRSND_XMEGA_OC0D                                                 // use OC0D
        XMEGA_Timer.CTRLB &= ~(1<<TC0_CCDEN_bp);                                        // Compare D disconnected
#    elif IRSND_OCx == IRSND_XMEGA_OC1A                                                 // use OC1A
                XMEGA_Timer.CTRLB &= ~(1<<TC1_CCAEN_bp);                                // Compare A disconnected
#    elif IRSND_OCx == IRSND_XMEGA_OC1B                                                 // use OC1B
                XMEGA_Timer.CTRLB &= ~(1<<TC1_CCBEN_bp);                                // Compare B disconnected
#    else
#       error wrong value of IRSND_OCx
#    endif // IRSND_OCx

#  else //AVR

#    if   IRSND_OCx == IRSND_OC2                        // use OC2
        TCCR2 &= ~(1<<COM20);                           // normal port operation, OC2 disconnected.
#    elif IRSND_OCx == IRSND_OC2A                       // use OC2A
        TCCR2A &= ~(1<<COM2A0);                         // normal port operation, OC2A disconnected.
#    elif IRSND_OCx == IRSND_OC2B                       // use OC2B
        TCCR2A &= ~(1<<COM2B0);                         // normal port operation, OC2B disconnected.
#    elif IRSND_OCx == IRSND_OC0                        // use OC0
        TCCR0 &= ~(1<<COM00);                           // normal port operation, OC0 disconnected.
#    elif IRSND_OCx == IRSND_OC0A                       // use OC0A
        TCCR0A &= ~(1<<COM0A0);                         // normal port operation, OC0A disconnected.
#    elif IRSND_OCx == IRSND_OC0B                       // use OC0B
        TCCR0A &= ~(1<<COM0B0);                         // normal port operation, OC0B disconnected.
#    else
#      error wrong value of IRSND_OCx
#    endif // IRSND_OCx
        IRSND_PORT  &= ~(1<<IRSND_BIT);                 // set IRSND_BIT to low
#  endif //C18
#endif // ANALYZE

#if IRSND_USE_CALLBACK == 1
        if (irsnd_callback_ptr)
        {
           (*irsnd_callback_ptr) (FALSE);
        }
#endif // IRSND_USE_CALLBACK == 1

        irsnd_is_on = FALSE;
    }
}

/*---------------------------------------------------------------------------------------------------------------------------------------------------
 *  Set PWM frequency
 *  @details  sets pwm frequency
 *---------------------------------------------------------------------------------------------------------------------------------------------------
 */
#if defined(__12F1840)
extern void pwm_init(uint16_t freq);
#include <stdio.h>
#endif

static void
irsnd_set_freq (IRSND_FREQ_TYPE freq)
{
#ifndef ANALYZE
#  if defined(PIC_C18)                                                                      // PIC C18 or XC8
#    if defined(__12F1840)                                                                  // XC8
        TRISA2=0;
        PR2=freq;
        CCP1M0=1;
        CCP1M1=1;
        CCP1M2=1;
        CCP1M3=1;
        DC1B0=1;
        DC1B1=0;
        CCPR1L = 0b01101001;
        TMR2IF = 0;
        TMR2ON=1;
        CCP1CON &=(~0b0011); // p 197 "active high"
#    else                                                                                   // PIC C18
        OpenPWM(freq);
        SetDCPWM( (uint16_t) (freq * 2) + 1); // freq*2 = Duty cycles 50%
#    endif
        PWMoff();
#  elif defined (ARM_STM32)                                                                 // STM32
        static uint32_t      TimeBaseFreq = 0;

        if (TimeBaseFreq == 0)
        {
            RCC_ClocksTypeDef        RCC_ClocksStructure;
            /* Get system clocks and store timer clock in variable */
            RCC_GetClocksFreq(&RCC_ClocksStructure);
#    if ((IRSND_TIMER_NUMBER >= 2) && (IRSND_TIMER_NUMBER <= 5)) || ((IRSND_TIMER_NUMBER >= 12) && (IRSND_TIMER_NUMBER <= 14))
            if (RCC_ClocksStructure.PCLK1_Frequency == RCC_ClocksStructure.HCLK_Frequency)
            {
               TimeBaseFreq = RCC_ClocksStructure.PCLK1_Frequency;
            }
            else
            {
               TimeBaseFreq = RCC_ClocksStructure.PCLK1_Frequency * 2;
            }
#    else
            if (RCC_ClocksStructure.PCLK2_Frequency == RCC_ClocksStructure.HCLK_Frequency)
            {
               TimeBaseFreq = RCC_ClocksStructure.PCLK2_Frequency;
            }
            else
            {
               TimeBaseFreq = RCC_ClocksStructure.PCLK2_Frequency * 2;
            }
#    endif
        }

        freq = TimeBaseFreq/freq;

        /* Set frequency */
        TIM_SetAutoreload(IRSND_TIMER, freq - 1);
        /* Set duty cycle */
        TIM_SetCompare1(IRSND_TIMER, (freq + 1) / 2);

#  elif defined (ARM_STM32_HAL)                                                            // STM32 with Hal Library

        TIM_MasterConfigTypeDef sMasterConfig;
        TIM_OC_InitTypeDef sConfigOC;

        uint32_t uwPrescalerValue = (uint32_t) ((IRSND_TIMER_SPEED_APBX) / (freq*10)) - 1; //1kHz

        //IRSND_TIMER_HANDLER.Instance = TIM2;
        IRSND_TIMER_HANDLER.Init.Prescaler = uwPrescalerValue;
        IRSND_TIMER_HANDLER.Init.CounterMode = TIM_COUNTERMODE_UP;
        IRSND_TIMER_HANDLER.Init.Period = 10 -1;
        IRSND_TIMER_HANDLER.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
        IRSND_TIMER_HANDLER.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

        if (HAL_TIM_PWM_Init(&IRSND_TIMER_HANDLER) != HAL_OK)
        {
            _Error_Handler(__FILE__, __LINE__);
        }

