YanMinge/mm32_irmp_irsnd/src/components/Irsnd/irsnd.c
#    endif

        /* TIMx clock enable */
#    if ((IRSND_TIMER_NUMBER >= 2) && (IRSND_TIMER_NUMBER <= 5)) || ((IRSND_TIMER_NUMBER >= 12) && (IRSND_TIMER_NUMBER <= 14))
        RCC_APB1PeriphClockCmd(IRSND_TIMER_RCC, ENABLE);
#    else
        RCC_APB2PeriphClockCmd(IRSND_TIMER_RCC, ENABLE);
#    endif

        /* Time base configuration */
        TIM_TimeBaseStructure.TIM_Period = -1;     // set dummy value (don't set to 0), will be initialized later
        TIM_TimeBaseStructure.TIM_Prescaler = 0;
        TIM_TimeBaseStructure.TIM_ClockDivision = 0;
        TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
        TIM_TimeBaseInit(IRSND_TIMER, &TIM_TimeBaseStructure);

        /* PWM1 Mode configuration */
        TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
        TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
        TIM_OCInitStructure.TIM_Pulse = 0;         // will be initialized later
        TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
        TIM_OC1Init(IRSND_TIMER, &TIM_OCInitStructure);

        /* Preload configuration */
        TIM_ARRPreloadConfig(IRSND_TIMER, ENABLE);
        TIM_OC1PreloadConfig(IRSND_TIMER, TIM_OCPreload_Enable);

        irsnd_set_freq (IRSND_FREQ_36_KHZ);                                         // set default frequency

#  elif defined (ARM_STM32_HAL)
        irsnd_set_freq (IRSND_FREQ_36_KHZ);                                         // default frequency

#  elif defined (TEENSY_ARM_CORTEX_M4)
        if (!digitalPinHasPWM(IRSND_PIN))
        {
            return;
        }

#  elif defined (__xtensa__)
        pinMode(IRSND_PIN, OUTPUT);
        irsnd_set_freq (IRSND_FREQ_36_KHZ);

#  elif defined (ARM_MM32F013X)
        drv_gpio_pwm_mode(IRSND_PIN, IRSND_FREQ_38_KHZ);                            // set default frequency

#  elif defined (__AVR_XMEGA__)
        IRSND_PORT &= ~(1<<IRSND_BIT);                                              // set IRSND_BIT to low
        IRSND_DDR |= (1<<IRSND_BIT);                                                // set IRSND_BIT to output

        XMEGA_Timer.PER = 0xFFFF; //Topwert
        XMEGA_Timer.CTRLB |= TC_WGMODE_FRQ_gc; //Modus: Frequenz entspricht CTC

#    if AVR_PRESCALER == 8
        XMEGA_Timer.CTRLA |= TC_CLKSEL_DIV8_gc;                                     // start Timer  prescaler = 8
#    else
        XMEGA_Timer.CTRLA |= TC_CLKSEL_DIV1_gc;                                     // start Timer  prescaler = 1
#    endif

# else                                                                              // AVR
        IRSND_PORT &= ~(1<<IRSND_BIT);                                              // set IRSND_BIT to low
        IRSND_DDR |= (1<<IRSND_BIT);                                                // set IRSND_BIT to output

#    if   IRSND_OCx == IRSND_OC2                                                    // use OC2
        TCCR2 = (1<<WGM21);                                                         // CTC mode
#       if AVR_PRESCALER == 8
          TCCR2 |= (1<<CS21);                                                       // start Timer 2, prescaler = 8
#       else
          TCCR2 |= (1<<CS20);                                                       // start Timer 2, prescaler = 1
#       endif
#    elif IRSND_OCx == IRSND_OC2A || IRSND_OCx == IRSND_OC2B                        // use OC2A or OC2B
        TCCR2A = (1<<WGM21);                                                        // CTC mode
#       if AVR_PRESCALER == 8
          TCCR2B = (1<<CS21);                                                       // start Timer 2, prescaler = 8
#       else
          TCCR2B = (1<<CS20);                                                       // start Timer 2, prescaler = 1
#       endif
#    elif IRSND_OCx == IRSND_OC0                                                    // use OC0
        TCCR0 = (1<<WGM01);                                                         // CTC mode
#       if AVR_PRESCALER == 8
          TCCR0 |= (1<<CS01);                                                       // start Timer 0, prescaler = 8
#       else
          TCCR0 |= (1<<CS00);                                                       // start Timer 0, prescaler = 1
#       endif
#    elif IRSND_OCx == IRSND_OC0A || IRSND_OCx == IRSND_OC0B                        // use OC0A or OC0B
        TCCR0A = (1<<WGM01);                                                        // CTC mode
#       if AVR_PRESCALER == 8
          TCCR0B = (1<<CS01);                                                       // start Timer 0, prescaler = 8
#       else
          TCCR0B = (1<<CS00);                                                       // start Timer 0, prescaler = 1
#       endif
#    else
#      error wrong value of IRSND_OCx
#    endif
        irsnd_set_freq (IRSND_FREQ_36_KHZ);                                         // default frequency
#  endif //PIC_C18
#endif // ANALYZE
}

#if IRSND_USE_CALLBACK == 1
void
irsnd_set_callback_ptr (void (*cb)(uint8_t))
{
    irsnd_callback_ptr = cb;
}
#endif // IRSND_USE_CALLBACK == 1

#endif // ARDUINO

#  ifdef __cplusplus
bool
#else
uint8_t
#endif
irsnd_is_busy (void)
{
    return irsnd_busy;
}

static uint16_t
bitsrevervse (uint16_t x, uint8_t len)
{
    uint16_t    xx = 0;

    while(len)
    {
        xx <<= 1;
        if (x & 1)
        {
            xx |= 1;
        }
        x >>= 1;
        len--;
    }
    return xx;
}


#if IRSND_SUPPORT_SIRCS_PROTOCOL == 1
static uint8_t  sircs_additional_bitlen;
#endif // IRSND_SUPPORT_SIRCS_PROTOCOL == 1

#if (MATATALAB_FEATURE == 1)
ir_universal_data_type irsnd_universal_data_buf[IRDATALEN] = {0};
uint16_t irsnd_universal_data_length = 0;
#  ifdef __cplusplus
bool
#else
uint8_t
#endif
irsnd_send_universal_data(ir_universal_data_type *irmp_data_buffer, uint16_t length, uint8_t do_wait)
{
    if (do_wait)
    {
        while (irsnd_busy)
        {
            // wait for last command to have ended
        }
    }
    else if (irsnd_busy)
    {
        return (FALSE);
    }
    irsnd_protocol = IRMP_UNIVERSAL_PROTOCOL;
    memcpy(irsnd_universal_data_buf, irmp_data_buffer, length * sizeof(ir_universal_data_type));
    irsnd_universal_data_length = length;
    // uint16_t i;
    // log_uart_printf(UART1, "irsnd_send_universal_data:\r\n");
    // for(i = 0; i <length; i++)
    // {
    //     log_uart_printf(UART1, "0x%02x[0x%02x] ", irsnd_universal_data_buf[i].ir_value, irsnd_universal_data_buf[i].ir_value_num);
    // }
    // log_uart_printf(UART1, "\r\n");
    irsnd_busy = true;
    return irsnd_busy;
}
#endif //(MATATALAB_FEATURE == 1)

