YanMinge/mm32_irmp_irsnd/src/components/Irsnd/irsnd.c
                if (auto_repetition_pause_counter >= auto_repetition_pause_len)
                {
                    auto_repetition_pause_counter = 0;

#if IRSND_SUPPORT_DENON_PROTOCOL == 1
                    if (irsnd_protocol == IRMP_DENON_PROTOCOL)                              // n'th denon frame
                    {
                        current_bit = 16;
                        complete_data_len   = 2 * DENON_COMPLETE_DATA_LEN + 1;
                    }
                    else
#endif
#if IRSND_SUPPORT_GRUNDIG_PROTOCOL == 1
                    if (irsnd_protocol == IRMP_GRUNDIG_PROTOCOL)                            // n'th grundig frame
                    {
                        current_bit = 15;
                        complete_data_len   = 16 + GRUNDIG_COMPLETE_DATA_LEN;
                    }
                    else
#endif
#if IRSND_SUPPORT_IR60_PROTOCOL == 1
                    if (irsnd_protocol == IRMP_IR60_PROTOCOL)                               // n'th IR60 frame
                    {
                        current_bit = 7;
                        complete_data_len   = 2 * IR60_COMPLETE_DATA_LEN + 1;
                    }
                    else
#endif
#if IRSND_SUPPORT_NOKIA_PROTOCOL == 1
                    if (irsnd_protocol == IRMP_NOKIA_PROTOCOL)                              // n'th nokia frame
                    {
                        if (auto_repetition_counter + 1 < n_auto_repetitions)
                        {
                            current_bit = 23;
                            complete_data_len   = 24 + NOKIA_COMPLETE_DATA_LEN;
                        }
                        else                                                                // nokia stop frame
                        {
                            current_bit = 0xFF;
                            complete_data_len   = NOKIA_COMPLETE_DATA_LEN;
                        }
                    }
                    else
#endif
                    {
                        ;
                    }
                }
                else
                {
#ifdef ANALYZE
                    if (irsnd_is_on)
                    {
                        putchar ('0');
                    }
                    else
                    {
                        putchar ('1');
                    }
#endif
                    return irsnd_busy;
                }
            }
            else if (packet_repeat_pause_counter < repeat_frame_pause_len)
            {
                packet_repeat_pause_counter++;
#ifdef ANALYZE
                if (irsnd_is_on)
                {
                    putchar ('0');
                }
                else
                {
                    putchar ('1');
                }
#endif
                return irsnd_busy;
            }
            else
            {
                if (send_trailer)
                {
                    irsnd_busy = FALSE;
                    send_trailer = FALSE;
                    return irsnd_busy;
                }

                n_repeat_frames             = irsnd_repeat;

                if (n_repeat_frames == IRSND_ENDLESS_REPETITION)
                {
                    n_repeat_frames = 255;
                }

                packet_repeat_pause_counter = 0;
                pulse_counter               = 0;
                pause_counter               = 0;

                switch (irsnd_protocol)
                {
#if IRSND_SUPPORT_SIRCS_PROTOCOL == 1
                    case IRMP_SIRCS_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_SIRCS_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_SIRCS_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_SIRCS_1_PULSE_LEN;
                        pause_1_len                 = IRSND_SIRCS_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_SIRCS_0_PULSE_LEN;
                        pause_0_len                 = IRSND_SIRCS_PAUSE_LEN - 1;
                        has_stop_bit                = SIRCS_STOP_BIT;
                        complete_data_len           = SIRCS_MINIMUM_DATA_LEN + sircs_additional_bitlen;
                        n_auto_repetitions          = (repeat_counter == 0) ? SIRCS_FRAMES : 1;             // 3 frames auto repetition if first frame
                        auto_repetition_pause_len   = IRSND_SIRCS_AUTO_REPETITION_PAUSE_LEN;                // 25ms pause
                        repeat_frame_pause_len      = IRSND_SIRCS_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_40_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_NEC_PROTOCOL == 1
                    case IRMP_NEC_PROTOCOL:
                    case IRMP_NEC_REPETITION_PROTOCOL:
                    case IRMP_ONKYO_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_NEC_START_BIT_PULSE_LEN;

                        if (repeat_counter > 0 || irsnd_protocol == IRMP_NEC_REPETITION_PROTOCOL)
                        {
                            startbit_pause_len      = IRSND_NEC_REPEAT_START_BIT_PAUSE_LEN - 1;
                            complete_data_len       = 0;
                        }
                        else
                        {
                            startbit_pause_len      = IRSND_NEC_START_BIT_PAUSE_LEN - 1;
                            complete_data_len       = NEC_COMPLETE_DATA_LEN;
                        }

                        pulse_1_len                 = IRSND_NEC_PULSE_LEN;
                        pause_1_len                 = IRSND_NEC_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_NEC_PULSE_LEN;
                        pause_0_len                 = IRSND_NEC_0_PAUSE_LEN - 1;
                        has_stop_bit                = NEC_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_NEC_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_NEC16_PROTOCOL == 1
                    case IRMP_NEC16_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_NEC_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_NEC_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_NEC_PULSE_LEN;
                        pause_1_len                 = IRSND_NEC_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_NEC_PULSE_LEN;
                        pause_0_len                 = IRSND_NEC_0_PAUSE_LEN - 1;
                        has_stop_bit                = NEC_STOP_BIT;
                        complete_data_len           = NEC16_COMPLETE_DATA_LEN + 1;                          // 1 more: sync bit
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_NEC_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_NEC42_PROTOCOL == 1
                    case IRMP_NEC42_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_NEC_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_NEC_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_NEC_PULSE_LEN;
                        pause_1_len                 = IRSND_NEC_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_NEC_PULSE_LEN;
                        pause_0_len                 = IRSND_NEC_0_PAUSE_LEN - 1;
                        has_stop_bit                = NEC_STOP_BIT;
                        complete_data_len           = NEC42_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_NEC_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_MELINERA_PROTOCOL == 1
                    case IRMP_MELINERA_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_MELINERA_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_MELINERA_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_MELINERA_1_PULSE_LEN;
                        pause_1_len                 = IRSND_MELINERA_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_MELINERA_0_PULSE_LEN;
                        pause_0_len                 = IRSND_MELINERA_0_PAUSE_LEN - 1;
                        has_stop_bit                = MELINERA_STOP_BIT;
                        complete_data_len           = MELINERA_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_MELINERA_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_LGAIR_PROTOCOL == 1
                    case IRMP_LGAIR_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_NEC_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_NEC_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_NEC_PULSE_LEN;
                        pause_1_len                 = IRSND_NEC_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_NEC_PULSE_LEN;
                        pause_0_len                 = IRSND_NEC_0_PAUSE_LEN - 1;
                        has_stop_bit                = NEC_STOP_BIT;
                        complete_data_len           = LGAIR_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_NEC_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_SAMSUNG_PROTOCOL == 1
                    case IRMP_SAMSUNG_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_SAMSUNG_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_SAMSUNG_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_SAMSUNG_PULSE_LEN;
                        pause_1_len                 = IRSND_SAMSUNG_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_SAMSUNG_PULSE_LEN;
                        pause_0_len                 = IRSND_SAMSUNG_0_PAUSE_LEN - 1;
                        has_stop_bit                = SAMSUNG_STOP_BIT;
                        complete_data_len           = SAMSUNG_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_SAMSUNG_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }

