YanMinge/mm32_irmp_irsnd/src/components/Irsnd/irsnd.c
                    case IRMP_SAMSUNG32_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_SAMSUNG_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_SAMSUNG_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_SAMSUNG_PULSE_LEN;
                        pause_1_len                 = IRSND_SAMSUNG_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_SAMSUNG_PULSE_LEN;
                        pause_0_len                 = IRSND_SAMSUNG_0_PAUSE_LEN - 1;
                        has_stop_bit                = SAMSUNG_STOP_BIT;
                        complete_data_len           = SAMSUNG32_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = SAMSUNG32_FRAMES;                                     // 1 frame
                        auto_repetition_pause_len   = IRSND_SAMSUNG32_AUTO_REPETITION_PAUSE_LEN;            // 47 ms pause
                        repeat_frame_pause_len      = IRSND_SAMSUNG32_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_SAMSUNG48_PROTOCOL == 1
                    case IRMP_SAMSUNG48_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_SAMSUNG_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_SAMSUNG_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_SAMSUNG_PULSE_LEN;
                        pause_1_len                 = IRSND_SAMSUNG_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_SAMSUNG_PULSE_LEN;
                        pause_0_len                 = IRSND_SAMSUNG_0_PAUSE_LEN - 1;
                        has_stop_bit                = SAMSUNG_STOP_BIT;
                        complete_data_len           = SAMSUNG48_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = SAMSUNG48_FRAMES;                                     // 1 frame
                        auto_repetition_pause_len   = IRSND_SAMSUNG48_AUTO_REPETITION_PAUSE_LEN;            // 47 ms pause
                        repeat_frame_pause_len      = IRSND_SAMSUNG48_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_MATSUSHITA_PROTOCOL == 1
                    case IRMP_MATSUSHITA_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_MATSUSHITA_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_MATSUSHITA_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_MATSUSHITA_PULSE_LEN;
                        pause_1_len                 = IRSND_MATSUSHITA_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_MATSUSHITA_PULSE_LEN;
                        pause_0_len                 = IRSND_MATSUSHITA_0_PAUSE_LEN - 1;
                        has_stop_bit                = MATSUSHITA_STOP_BIT;
                        complete_data_len           = MATSUSHITA_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_MATSUSHITA_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_TECHNICS_PROTOCOL == 1
                    case IRMP_TECHNICS_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_MATSUSHITA_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_MATSUSHITA_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_MATSUSHITA_PULSE_LEN;
                        pause_1_len                 = IRSND_MATSUSHITA_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_MATSUSHITA_PULSE_LEN;
                        pause_0_len                 = IRSND_MATSUSHITA_0_PAUSE_LEN - 1;
                        has_stop_bit                = MATSUSHITA_STOP_BIT;
                        complete_data_len           = TECHNICS_COMPLETE_DATA_LEN;                           // here TECHNICS
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_MATSUSHITA_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_KASEIKYO_PROTOCOL == 1
                    case IRMP_KASEIKYO_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_KASEIKYO_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_KASEIKYO_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_KASEIKYO_PULSE_LEN;
                        pause_1_len                 = IRSND_KASEIKYO_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_KASEIKYO_PULSE_LEN;
                        pause_0_len                 = IRSND_KASEIKYO_0_PAUSE_LEN - 1;
                        has_stop_bit                = KASEIKYO_STOP_BIT;
                        complete_data_len           = KASEIKYO_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = (repeat_counter == 0) ? KASEIKYO_FRAMES : 1;          // 2 frames auto repetition if first frame
                        auto_repetition_pause_len   = IRSND_KASEIKYO_AUTO_REPETITION_PAUSE_LEN;             // 75 ms pause
                        repeat_frame_pause_len      = IRSND_KASEIKYO_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_PANASONIC_PROTOCOL == 1
                    case IRMP_PANASONIC_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_PANASONIC_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_PANASONIC_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_PANASONIC_PULSE_LEN;
                        pause_1_len                 = IRSND_PANASONIC_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_PANASONIC_PULSE_LEN;
                        pause_0_len                 = IRSND_PANASONIC_0_PAUSE_LEN - 1;
                        has_stop_bit                = PANASONIC_STOP_BIT;
                        complete_data_len           = PANASONIC_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = PANASONIC_FRAMES;                                     // 1 frame
                        auto_repetition_pause_len   = IRSND_PANASONIC_AUTO_REPETITION_PAUSE_LEN;            // 40 ms pause
                        repeat_frame_pause_len      = IRSND_PANASONIC_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_MITSU_HEAVY_PROTOCOL == 1
                    case IRMP_MITSU_HEAVY_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_MITSU_HEAVY_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_MITSU_HEAVY_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_MITSU_HEAVY_PULSE_LEN;
                        pause_1_len                 = IRSND_MITSU_HEAVY_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_MITSU_HEAVY_PULSE_LEN;
                        pause_0_len                 = IRSND_MITSU_HEAVY_0_PAUSE_LEN - 1;
                        has_stop_bit                = MITSU_HEAVY_STOP_BIT;
                        complete_data_len           = MITSU_HEAVY_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = MITSU_HEAVY_FRAMES;                                   // 1 frame
                        auto_repetition_pause_len   = 0;;
                        repeat_frame_pause_len      = IRSND_MITSU_HEAVY_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_40_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_RECS80_PROTOCOL == 1
                    case IRMP_RECS80_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_RECS80_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_RECS80_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_RECS80_PULSE_LEN;
                        pause_1_len                 = IRSND_RECS80_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_RECS80_PULSE_LEN;
                        pause_0_len                 = IRSND_RECS80_0_PAUSE_LEN - 1;
                        has_stop_bit                = RECS80_STOP_BIT;
                        complete_data_len           = RECS80_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_RECS80_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_RECS80EXT_PROTOCOL == 1
                    case IRMP_RECS80EXT_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_RECS80EXT_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_RECS80EXT_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_RECS80EXT_PULSE_LEN;
                        pause_1_len                 = IRSND_RECS80EXT_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_RECS80EXT_PULSE_LEN;
                        pause_0_len                 = IRSND_RECS80EXT_0_PAUSE_LEN - 1;
                        has_stop_bit                = RECS80EXT_STOP_BIT;
                        complete_data_len           = RECS80EXT_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_RECS80EXT_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_TELEFUNKEN_PROTOCOL == 1
                    case IRMP_TELEFUNKEN_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_TELEFUNKEN_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_TELEFUNKEN_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_TELEFUNKEN_PULSE_LEN;
                        pause_1_len                 = IRSND_TELEFUNKEN_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_TELEFUNKEN_PULSE_LEN;
                        pause_0_len                 = IRSND_TELEFUNKEN_0_PAUSE_LEN - 1;
                        has_stop_bit                = TELEFUNKEN_STOP_BIT;
                        complete_data_len           = TELEFUNKEN_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frames
                        auto_repetition_pause_len   = 0;                                                    // IRSND_TELEFUNKEN_AUTO_REPETITION_PAUSE_LEN; xx ms pause
                        repeat_frame_pause_len      = IRSND_TELEFUNKEN_FRAME_REPEAT_PAUSE_LEN;              // 117 msec pause
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_RC5_PROTOCOL == 1
                    case IRMP_RC5_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_RC5_BIT_LEN;
                        startbit_pause_len          = IRSND_RC5_BIT_LEN;
                        pulse_len                   = IRSND_RC5_BIT_LEN;
                        pause_len                   = IRSND_RC5_BIT_LEN;
                        has_stop_bit                = RC5_STOP_BIT;
                        complete_data_len           = RC5_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_RC5_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_RC6_PROTOCOL == 1
                    case IRMP_RC6_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_RC6_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_RC6_START_BIT_PAUSE_LEN - 1;
                        pulse_len                   = IRSND_RC6_BIT_LEN;
                        pause_len                   = IRSND_RC6_BIT_LEN;
                        has_stop_bit                = RC6_STOP_BIT;
                        complete_data_len           = RC6_COMPLETE_DATA_LEN_SHORT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_RC6_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_RC6A_PROTOCOL == 1
                    case IRMP_RC6A_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_RC6_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_RC6_START_BIT_PAUSE_LEN - 1;
                        pulse_len                   = IRSND_RC6_BIT_LEN;
                        pause_len                   = IRSND_RC6_BIT_LEN;
                        has_stop_bit                = RC6_STOP_BIT;
                        complete_data_len           = RC6_COMPLETE_DATA_LEN_LONG;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_RC6_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_DENON_PROTOCOL == 1
                    case IRMP_DENON_PROTOCOL:
                    {
                        startbit_pulse_len          = 0x00;
                        startbit_pause_len          = 0x00;
                        pulse_1_len                 = IRSND_DENON_PULSE_LEN;
                        pause_1_len                 = IRSND_DENON_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_DENON_PULSE_LEN;
                        pause_0_len                 = IRSND_DENON_0_PAUSE_LEN - 1;
                        has_stop_bit                = DENON_STOP_BIT;
                        complete_data_len           = DENON_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = DENON_FRAMES;                                         // 2 frames, 2nd with inverted command
                        auto_repetition_pause_len   = IRSND_DENON_AUTO_REPETITION_PAUSE_LEN;                // 65 ms pause after 1st frame
                        repeat_frame_pause_len      = IRSND_DENON_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);                                                 // in theory 32kHz, in practice 36kHz is better
                        break;
                    }
#endif
#if IRSND_SUPPORT_THOMSON_PROTOCOL == 1
                    case IRMP_THOMSON_PROTOCOL:
                    {
                        startbit_pulse_len          = 0x00;
                        startbit_pause_len          = 0x00;
                        pulse_1_len                 = IRSND_THOMSON_PULSE_LEN;
                        pause_1_len                 = IRSND_THOMSON_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_THOMSON_PULSE_LEN;
                        pause_0_len                 = IRSND_THOMSON_0_PAUSE_LEN - 1;
                        has_stop_bit                = THOMSON_STOP_BIT;
                        complete_data_len           = THOMSON_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = THOMSON_FRAMES;                                       // only 1 frame
                        auto_repetition_pause_len   = IRSND_THOMSON_AUTO_REPETITION_PAUSE_LEN;
                        repeat_frame_pause_len      = IRSND_THOMSON_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_BOSE_PROTOCOL == 1
                    case IRMP_BOSE_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_BOSE_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_BOSE_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_BOSE_PULSE_LEN;
                        pause_1_len                 = IRSND_BOSE_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_BOSE_PULSE_LEN;
                        pause_0_len                 = IRSND_BOSE_0_PAUSE_LEN - 1;
                        has_stop_bit                = BOSE_STOP_BIT;
                        complete_data_len           = BOSE_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = BOSE_FRAMES;                                          // 1 frame
                        auto_repetition_pause_len   = IRSND_BOSE_AUTO_REPETITION_PAUSE_LEN;                 // 40 ms pause
                        repeat_frame_pause_len      = IRSND_BOSE_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_NUBERT_PROTOCOL == 1
                    case IRMP_NUBERT_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_NUBERT_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_NUBERT_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_NUBERT_1_PULSE_LEN;
                        pause_1_len                 = IRSND_NUBERT_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_NUBERT_0_PULSE_LEN;
                        pause_0_len                 = IRSND_NUBERT_0_PAUSE_LEN - 1;
                        has_stop_bit                = NUBERT_STOP_BIT;
                        complete_data_len           = NUBERT_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = NUBERT_FRAMES;                                        // 2 frames
                        auto_repetition_pause_len   = IRSND_NUBERT_AUTO_REPETITION_PAUSE_LEN;               // 35 ms pause
                        repeat_frame_pause_len      = IRSND_NUBERT_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_FAN_PROTOCOL == 1
                    case IRMP_FAN_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_FAN_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_FAN_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_FAN_1_PULSE_LEN;
                        pause_1_len                 = IRSND_FAN_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_FAN_0_PULSE_LEN;
                        pause_0_len                 = IRSND_FAN_0_PAUSE_LEN - 1;
                        has_stop_bit                = FAN_STOP_BIT;
                        complete_data_len           = FAN_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = FAN_FRAMES;                                           // only 1 frame
                        auto_repetition_pause_len   = IRSND_FAN_AUTO_REPETITION_PAUSE_LEN;                  // 35 ms pause
                        repeat_frame_pause_len      = IRSND_FAN_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_SPEAKER_PROTOCOL == 1
                    case IRMP_SPEAKER_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_SPEAKER_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_SPEAKER_START_BIT_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_SPEAKER_1_PULSE_LEN;
                        pause_1_len                 = IRSND_SPEAKER_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_SPEAKER_0_PULSE_LEN;
                        pause_0_len                 = IRSND_SPEAKER_0_PAUSE_LEN - 1;
                        has_stop_bit                = SPEAKER_STOP_BIT;
                        complete_data_len           = SPEAKER_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = SPEAKER_FRAMES;                                       // 2 frames
                        auto_repetition_pause_len   = IRSND_SPEAKER_AUTO_REPETITION_PAUSE_LEN;              // 35 ms pause
                        repeat_frame_pause_len      = IRSND_SPEAKER_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_BANG_OLUFSEN_PROTOCOL == 1
                    case IRMP_BANG_OLUFSEN_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_BANG_OLUFSEN_START_BIT1_PULSE_LEN;
                        startbit_pause_len          = IRSND_BANG_OLUFSEN_START_BIT1_PAUSE_LEN - 1;
                        pulse_1_len                 = IRSND_BANG_OLUFSEN_PULSE_LEN;
                        pause_1_len                 = IRSND_BANG_OLUFSEN_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_BANG_OLUFSEN_PULSE_LEN;
                        pause_0_len                 = IRSND_BANG_OLUFSEN_0_PAUSE_LEN - 1;
                        has_stop_bit                = BANG_OLUFSEN_STOP_BIT;
                        complete_data_len           = BANG_OLUFSEN_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_BANG_OLUFSEN_FRAME_REPEAT_PAUSE_LEN;
                        last_bit_value              = 0;
                        irsnd_set_freq (IRSND_FREQ_455_KHZ);
                        break;
                    }
#endif
