YanMinge/mm32_irmp_irsnd/src/components/Irsnd/irsnd.c
#if IRSND_SUPPORT_GRUNDIG_PROTOCOL == 1
                    case IRMP_GRUNDIG_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        startbit_pause_len          = IRSND_GRUNDIG_NOKIA_IR60_PRE_PAUSE_LEN - 1;
                        pulse_len                   = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        pause_len                   = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        has_stop_bit                = GRUNDIG_NOKIA_IR60_STOP_BIT;
                        complete_data_len           = GRUNDIG_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = GRUNDIG_FRAMES;                                       // 2 frames
                        auto_repetition_pause_len   = IRSND_GRUNDIG_AUTO_REPETITION_PAUSE_LEN;              // 20m sec pause
                        repeat_frame_pause_len      = IRSND_GRUNDIG_NOKIA_IR60_FRAME_REPEAT_PAUSE_LEN;      // 117 msec pause
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_IR60_PROTOCOL == 1
                    case IRMP_IR60_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        startbit_pause_len          = IRSND_GRUNDIG_NOKIA_IR60_PRE_PAUSE_LEN - 1;
                        pulse_len                   = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        pause_len                   = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        has_stop_bit                = GRUNDIG_NOKIA_IR60_STOP_BIT;
                        complete_data_len           = IR60_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = IR60_FRAMES;                                          // 2 frames
                        auto_repetition_pause_len   = IRSND_IR60_AUTO_REPETITION_PAUSE_LEN;                 // 20m sec pause
                        repeat_frame_pause_len      = IRSND_GRUNDIG_NOKIA_IR60_FRAME_REPEAT_PAUSE_LEN;      // 117 msec pause
                        irsnd_set_freq (IRSND_FREQ_30_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_NOKIA_PROTOCOL == 1
                    case IRMP_NOKIA_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        startbit_pause_len          = IRSND_GRUNDIG_NOKIA_IR60_PRE_PAUSE_LEN - 1;
                        pulse_len                   = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        pause_len                   = IRSND_GRUNDIG_NOKIA_IR60_BIT_LEN;
                        has_stop_bit                = GRUNDIG_NOKIA_IR60_STOP_BIT;
                        complete_data_len           = NOKIA_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = NOKIA_FRAMES;                                         // 2 frames
                        auto_repetition_pause_len   = IRSND_NOKIA_AUTO_REPETITION_PAUSE_LEN;                // 20 msec pause
                        repeat_frame_pause_len      = IRSND_GRUNDIG_NOKIA_IR60_FRAME_REPEAT_PAUSE_LEN;      // 117 msec pause
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_SIEMENS_PROTOCOL == 1
                    case IRMP_SIEMENS_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_SIEMENS_BIT_LEN;
                        startbit_pause_len          = IRSND_SIEMENS_BIT_LEN;
                        pulse_len                   = IRSND_SIEMENS_BIT_LEN;
                        pause_len                   = IRSND_SIEMENS_BIT_LEN;
                        has_stop_bit                = SIEMENS_OR_RUWIDO_STOP_BIT;
                        complete_data_len           = SIEMENS_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_SIEMENS_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_RUWIDO_PROTOCOL == 1
                    case IRMP_RUWIDO_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_RUWIDO_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_RUWIDO_START_BIT_PAUSE_LEN;
                        pulse_len                   = IRSND_RUWIDO_BIT_PULSE_LEN;
                        pause_len                   = IRSND_RUWIDO_BIT_PAUSE_LEN;
                        has_stop_bit                = SIEMENS_OR_RUWIDO_STOP_BIT;
                        complete_data_len           = RUWIDO_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_RUWIDO_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_36_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_FDC_PROTOCOL == 1
                    case IRMP_FDC_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_FDC_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_FDC_START_BIT_PAUSE_LEN - 1;
                        complete_data_len           = FDC_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_FDC_PULSE_LEN;
                        pause_1_len                 = IRSND_FDC_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_FDC_PULSE_LEN;
                        pause_0_len                 = IRSND_FDC_0_PAUSE_LEN - 1;
                        has_stop_bit                = FDC_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_FDC_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_RCCAR_PROTOCOL == 1
                    case IRMP_RCCAR_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_RCCAR_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_RCCAR_START_BIT_PAUSE_LEN - 1;
                        complete_data_len           = RCCAR_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_RCCAR_PULSE_LEN;
                        pause_1_len                 = IRSND_RCCAR_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_RCCAR_PULSE_LEN;
                        pause_0_len                 = IRSND_RCCAR_0_PAUSE_LEN - 1;
                        has_stop_bit                = RCCAR_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_RCCAR_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_JVC_PROTOCOL == 1
                    case IRMP_JVC_PROTOCOL:
                    {
                        if (repeat_counter != 0)                                                            // skip start bit if repetition frame
                        {
                            current_bit = 0;
                        }

                        startbit_pulse_len          = IRSND_JVC_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_JVC_START_BIT_PAUSE_LEN - 1;
                        complete_data_len           = JVC_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_JVC_PULSE_LEN;
                        pause_1_len                 = IRSND_JVC_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_JVC_PULSE_LEN;
                        pause_0_len                 = IRSND_JVC_0_PAUSE_LEN - 1;
                        has_stop_bit                = JVC_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_JVC_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_NIKON_PROTOCOL == 1
                    case IRMP_NIKON_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_NIKON_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_NIKON_START_BIT_PAUSE_LEN;
                        complete_data_len           = NIKON_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_NIKON_PULSE_LEN;
                        pause_1_len                 = IRSND_NIKON_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_NIKON_PULSE_LEN;
                        pause_0_len                 = IRSND_NIKON_0_PAUSE_LEN - 1;
                        has_stop_bit                = NIKON_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_NIKON_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_LEGO_PROTOCOL == 1
                    case IRMP_LEGO_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_LEGO_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_LEGO_START_BIT_PAUSE_LEN - 1;
                        complete_data_len           = LEGO_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_LEGO_PULSE_LEN;
                        pause_1_len                 = IRSND_LEGO_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_LEGO_PULSE_LEN;
                        pause_0_len                 = IRSND_LEGO_0_PAUSE_LEN - 1;
                        has_stop_bit                = LEGO_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_LEGO_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_IRMP16_PROTOCOL == 1
                    case IRMP_IRMP16_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_IRMP16_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_IRMP16_START_BIT_PAUSE_LEN - 1;
                        complete_data_len           = IRMP16_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_IRMP16_PULSE_LEN;
                        pause_1_len                 = IRSND_IRMP16_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_IRMP16_PULSE_LEN;
                        pause_0_len                 = IRSND_IRMP16_0_PAUSE_LEN - 1;
                        has_stop_bit                = IRMP16_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_IRMP16_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_A1TVBOX_PROTOCOL == 1
                    case IRMP_A1TVBOX_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_A1TVBOX_BIT_PULSE_LEN;                          // don't use A1TVBOX_START_BIT_PULSE_LEN
                        startbit_pause_len          = IRSND_A1TVBOX_BIT_PAUSE_LEN;                          // don't use A1TVBOX_START_BIT_PAUSE_LEN
                        pulse_len                   = IRSND_A1TVBOX_BIT_PULSE_LEN;
                        pause_len                   = IRSND_A1TVBOX_BIT_PAUSE_LEN;
                        has_stop_bit                = A1TVBOX_STOP_BIT;
                        complete_data_len           = A1TVBOX_COMPLETE_DATA_LEN + 1;                        // we send stop bit as data
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_A1TVBOX_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_ROOMBA_PROTOCOL == 1
                    case IRMP_ROOMBA_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_ROOMBA_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_ROOMBA_START_BIT_PAUSE_LEN;
                        pulse_1_len                 = IRSND_ROOMBA_1_PULSE_LEN;
                        pause_1_len                 = IRSND_ROOMBA_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_ROOMBA_0_PULSE_LEN;
                        pause_0_len                 = IRSND_ROOMBA_0_PAUSE_LEN - 1;
                        has_stop_bit                = ROOMBA_STOP_BIT;
                        complete_data_len           = ROOMBA_COMPLETE_DATA_LEN;
                        n_auto_repetitions          = ROOMBA_FRAMES;                                        // 8 frames
                        auto_repetition_pause_len   = IRSND_ROOMBA_FRAME_REPEAT_PAUSE_LEN;
                        repeat_frame_pause_len      = IRSND_ROOMBA_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_PENTAX_PROTOCOL == 1
                    case IRMP_PENTAX_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_PENTAX_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_PENTAX_START_BIT_PAUSE_LEN;
                        complete_data_len           = PENTAX_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_PENTAX_PULSE_LEN;
                        pause_1_len                 = IRSND_PENTAX_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_PENTAX_PULSE_LEN;
                        pause_0_len                 = IRSND_PENTAX_0_PAUSE_LEN - 1;
                        has_stop_bit                = PENTAX_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_PENTAX_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if IRSND_SUPPORT_ACP24_PROTOCOL == 1
                    case IRMP_ACP24_PROTOCOL:
                    {
                        startbit_pulse_len          = IRSND_ACP24_START_BIT_PULSE_LEN;
                        startbit_pause_len          = IRSND_ACP24_START_BIT_PAUSE_LEN - 1;
                        complete_data_len           = ACP24_COMPLETE_DATA_LEN;
                        pulse_1_len                 = IRSND_ACP24_PULSE_LEN;
                        pause_1_len                 = IRSND_ACP24_1_PAUSE_LEN - 1;
                        pulse_0_len                 = IRSND_ACP24_PULSE_LEN;
                        pause_0_len                 = IRSND_ACP24_0_PAUSE_LEN - 1;
                        has_stop_bit                = ACP24_STOP_BIT;
                        n_auto_repetitions          = 1;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        repeat_frame_pause_len      = IRSND_ACP24_FRAME_REPEAT_PAUSE_LEN;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        break;
                    }
#endif
#if (IRSND_SUPPORT_UNIVERSAL_PROTOCOL == 1) && (MATATALAB_FEATURE == 1)
                    case IRMP_UNIVERSAL_PROTOCOL:
                    {
                        n_auto_repetitions          = 0;                                                    // 1 frame
                        auto_repetition_pause_len   = 0;
                        irsnd_set_freq (IRSND_FREQ_38_KHZ);
                        current_transmission_bits   = 0;
                        current_pulse_counter       = 0;
                        break;
                    }
#endif
                    default:
                    {
                        irsnd_busy = FALSE;
                        break;
                    }
                }
            }
        }

        if (irsnd_busy)
        {
            new_frame = FALSE;

            switch (irsnd_protocol)
            {
#if IRSND_SUPPORT_SIRCS_PROTOCOL == 1
                case IRMP_SIRCS_PROTOCOL:
#endif
#if IRSND_SUPPORT_NEC_PROTOCOL == 1
                case IRMP_NEC_PROTOCOL:
                case IRMP_NEC_REPETITION_PROTOCOL:
                case IRMP_ONKYO_PROTOCOL:
#endif
#if IRSND_SUPPORT_NEC16_PROTOCOL == 1
                case IRMP_NEC16_PROTOCOL:
#endif
#if IRSND_SUPPORT_NEC42_PROTOCOL == 1
                case IRMP_NEC42_PROTOCOL:
#endif
#if IRSND_SUPPORT_MELINERA_PROTOCOL == 1
                case IRMP_MELINERA_PROTOCOL:
#endif
#if IRSND_SUPPORT_LGAIR_PROTOCOL == 1
                case IRMP_LGAIR_PROTOCOL:
#endif
#if IRSND_SUPPORT_SAMSUNG_PROTOCOL == 1
                case IRMP_SAMSUNG_PROTOCOL:
                case IRMP_SAMSUNG32_PROTOCOL:
#endif
#if IRSND_SUPPORT_SAMSUNG48_PROTOCOL == 1
                case IRMP_SAMSUNG48_PROTOCOL:
#endif
#if IRSND_SUPPORT_MATSUSHITA_PROTOCOL == 1
                case IRMP_MATSUSHITA_PROTOCOL:
#endif
#if IRSND_SUPPORT_MATSUSHITA_PROTOCOL == 1
                case IRMP_TECHNICS_PROTOCOL:
#endif
#if IRSND_SUPPORT_KASEIKYO_PROTOCOL == 1
                case IRMP_KASEIKYO_PROTOCOL:
#endif
#if IRSND_SUPPORT_PANASONIC_PROTOCOL == 1
                case IRMP_PANASONIC_PROTOCOL:
#endif
#if IRSND_SUPPORT_MITSU_HEAVY_PROTOCOL == 1
                case IRMP_MITSU_HEAVY_PROTOCOL:
#endif
#if IRSND_SUPPORT_RECS80_PROTOCOL == 1
                case IRMP_RECS80_PROTOCOL:
#endif
#if IRSND_SUPPORT_RECS80EXT_PROTOCOL == 1
                case IRMP_RECS80EXT_PROTOCOL:
#endif
#if IRSND_SUPPORT_TELEFUNKEN_PROTOCOL == 1
                case IRMP_TELEFUNKEN_PROTOCOL:
#endif
#if IRSND_SUPPORT_DENON_PROTOCOL == 1
                case IRMP_DENON_PROTOCOL:
#endif
#if IRSND_SUPPORT_BOSE_PROTOCOL == 1
                case IRMP_BOSE_PROTOCOL:
#endif
#if IRSND_SUPPORT_NUBERT_PROTOCOL == 1
                case IRMP_NUBERT_PROTOCOL:
#endif
#if IRSND_SUPPORT_FAN_PROTOCOL == 1
                case IRMP_FAN_PROTOCOL:
#endif
#if IRSND_SUPPORT_SPEAKER_PROTOCOL == 1
                case IRMP_SPEAKER_PROTOCOL:
#endif
#if IRSND_SUPPORT_BANG_OLUFSEN_PROTOCOL == 1
                case IRMP_BANG_OLUFSEN_PROTOCOL:
#endif
#if IRSND_SUPPORT_FDC_PROTOCOL == 1
                case IRMP_FDC_PROTOCOL:
#endif
#if IRSND_SUPPORT_RCCAR_PROTOCOL == 1
                case IRMP_RCCAR_PROTOCOL:
#endif
#if IRSND_SUPPORT_JVC_PROTOCOL == 1
                case IRMP_JVC_PROTOCOL:
#endif
#if IRSND_SUPPORT_NIKON_PROTOCOL == 1
                case IRMP_NIKON_PROTOCOL:
#endif
#if IRSND_SUPPORT_LEGO_PROTOCOL == 1
                case IRMP_LEGO_PROTOCOL:
#endif
#if IRSND_SUPPORT_IRMP16_PROTOCOL == 1
                case IRMP_IRMP16_PROTOCOL:
#endif
#if IRSND_SUPPORT_THOMSON_PROTOCOL == 1
                case IRMP_THOMSON_PROTOCOL:
#endif
#if IRSND_SUPPORT_ROOMBA_PROTOCOL == 1
                case IRMP_ROOMBA_PROTOCOL:
#endif
#if IRSND_SUPPORT_PENTAX_PROTOCOL == 1
                case IRMP_PENTAX_PROTOCOL:
#endif
#if IRSND_SUPPORT_ACP24_PROTOCOL == 1
                case IRMP_ACP24_PROTOCOL:
#endif

